zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_rsa.c
    return Cy_Crypto_Core_Rsa_Verify_Ext(base,
                                verResult,
                                digestType,
                                digest,
                                0,
                                decryptedSignature,
                                decryptedSignatureLength);
}
/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_Verify_Ext
****************************************************************************//**
*
* RSA verification with checks for content, paddings and signature format.
* SHA digest of the message and decrypted message should be calculated before.
* Supports only PKCS1-v1_5 format, inside of this format supported padding
* using only SHA, cases with MD2 and MD5 are not supported.
* PKCS1-v1_5 described here, page 31:
* http://www.emc.com/collateral/white-papers/h11300-pkcs-1v2-2-rsa-cryptography-standard-wp.pdf
*
* For CAT1C & CAT1D devices when D-Cache is enabled parameter decryptedSignature must align and end in 32 byte boundary.
*
* Returns the verification result \ref cy_en_crypto_rsa_ver_result_t.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param verResult
* The pointer to the verification result \ref cy_en_crypto_rsa_ver_result_t.
*
* \param digestType
* SHA mode used for hash calculation \ref cy_en_crypto_sha_mode_t.
*
* \param digest
* The pointer to the hash of the message or the message whose signature is to be verified.
*
* \param digestLength
* The length of the message whose signature is to be verified and is applicable for CY_CRYPTO_MODE_SHA_NONE mode.
*
* \param decryptedSignature
* The pointer to the decrypted signature to be verified.
*
* \param decryptedSignatureLength
* The length of the decrypted signature to be verified (in bytes)
*
* \return
* \ref cy_en_crypto_status_t
*
* \funcusage
* \snippet crypto/snippet/main.c snippet_myCryptoCoreRsaVerUse
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_Rsa_Verify_Ext(CRYPTO_Type *base,
                            cy_en_crypto_rsa_ver_result_t *verResult,
                            cy_en_crypto_sha_mode_t digestType,
                            uint8_t const *digest,
                            uint32_t digestLength,
                            uint8_t const *decryptedSignature,
                            uint32_t decryptedSignatureLength)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_SUCCESS;
    uint32_t encodingArrSize = 0u;
    uint32_t locDigestSize = 0u;
    uint32_t i;
    uint32_t psLength;
    uint32_t cmpRes = 0u;
    uint8_t *digestRemap;
    uint8_t *decryptedSignatureRemap;
    uint8_t *decryptedSignatureIn;
    uint8_t *encodingArr = NULL;
    uint8_t *encodingArrRemap = NULL;

    if( (NULL == verResult) || ((NULL == digest) && (digestLength != 0UL))  || (NULL == decryptedSignature) )
    {
        tmpResult =  CY_CRYPTO_BAD_PARAMS;
    }

    digestRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(digest);
    decryptedSignatureRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(decryptedSignature);
    decryptedSignatureIn = (uint8_t *)decryptedSignature;

    if(tmpResult == CY_CRYPTO_SUCCESS)
    {
        switch (digestType)
        {

        #if (CPUSS_CRYPTO_SHA1 == 1) && defined(CY_CRYPTO_CFG_SHA1_ENABLED)
        case CY_CRYPTO_MODE_SHA1:
            encodingArr  = (uint8_t *)sha1EncStr;
            encodingArrSize = sizeof(sha1EncStr);
            locDigestSize      = CY_CRYPTO_SHA1_DIGEST_SIZE;
            break;
        #endif /* (CPUSS_CRYPTO_SHA1 == 1) && defined(CY_CRYPTO_CFG_SHA1_ENABLED) */

        #if (CPUSS_CRYPTO_SHA256 == 1) && defined(CY_CRYPTO_CFG_SHA2_256_ENABLED)
        case CY_CRYPTO_MODE_SHA224:
            encodingArr  = (uint8_t *)sha224EncStr;
            encodingArrSize = sizeof(sha224EncStr);
            locDigestSize      = CY_CRYPTO_SHA224_DIGEST_SIZE;
            break;

        case CY_CRYPTO_MODE_SHA256:
            encodingArr  = (uint8_t *)sha256EncStr;
            encodingArrSize = sizeof(sha256EncStr);
            locDigestSize      = CY_CRYPTO_SHA256_DIGEST_SIZE;
            break;
        #endif /* (CPUSS_CRYPTO_SHA256 == 1) && defined(CY_CRYPTO_CFG_SHA2_256_ENABLED) */

        #if (CPUSS_CRYPTO_SHA512 == 1) && defined(CY_CRYPTO_CFG_SHA2_512_ENABLED)
        case CY_CRYPTO_MODE_SHA384:
            encodingArr  = (uint8_t *)sha384EncStr;
            encodingArrSize = sizeof(sha384EncStr);
            locDigestSize      = CY_CRYPTO_SHA384_DIGEST_SIZE;
            break;

        case CY_CRYPTO_MODE_SHA512:
            encodingArr  = (uint8_t *)sha512EncStr;
            encodingArrSize = sizeof(sha512EncStr);
            locDigestSize      = CY_CRYPTO_SHA512_DIGEST_SIZE;
            break;

        case CY_CRYPTO_MODE_SHA512_224:
            encodingArr  = (uint8_t *)sha512_224EncStr;
            encodingArrSize = sizeof(sha512_224EncStr);
            locDigestSize      = CY_CRYPTO_SHA512_224_DIGEST_SIZE;
            break;

        case CY_CRYPTO_MODE_SHA512_256:
            encodingArr  = (uint8_t *)sha512_256EncStr;
            encodingArrSize = sizeof(sha512_256EncStr);
            locDigestSize      = CY_CRYPTO_SHA512_256_DIGEST_SIZE;
            break;
        #endif /* (CPUSS_CRYPTO_SHA512 == 1) && defined(CY_CRYPTO_CFG_SHA2_512_ENABLED) */
        case CY_CRYPTO_MODE_SHA_NONE:
            encodingArr  = NULL;
            encodingArrSize = 0;
            locDigestSize  = digestLength;
            break;
        default:
        /* Unknown Digest Type */
            break;
        }

        /* Fail by default */
        *verResult = CY_CRYPTO_RSA_VERIFY_FAIL;

        encodingArrRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(encodingArr);

        if (CY_CRYPTO_MODE_SHA_NONE != digestType)
        {
            /* Check size of decrypted message */
            if (decryptedSignatureLength < (encodingArrSize + locDigestSize + 11u))
            {
                cmpRes = 1u;  /* further checking is not needed */
            }

