zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_rsa.c
        }


        psLength = decryptedSignatureLength - locDigestSize - encodingArrSize - 3u;

        /* Check whether the begin of message is 0x00, 0x01 and after PS string (before T string) is 0x00 byte.*/
        if ( (0u != cmpRes) ||
            (0x00u != *(decryptedSignatureIn)) ||
            (0x01u != *(decryptedSignatureIn + 1)) ||
            (0x00u != *(decryptedSignatureIn + psLength + 2u)) )
        {
            cmpRes = 1u;  /* Further checking is not needed */
        }

        /* Check FFs */
        if (0u == cmpRes )
        {
            for (i = 0u; i < psLength; i++)
            {
                if (0xFFu != *(decryptedSignatureIn + 2u + i))
                {
                    cmpRes = 1u;  /* Further checking is not needed */
                    break;
                }
            }
        }

    #if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)

            /* Flush the cache */
            SCB_CleanDCache_by_Addr((volatile void *)(decryptedSignatureIn),(int32_t)decryptedSignatureLength);
    #endif

        if ((CY_CRYPTO_MODE_SHA_NONE != digestType) && (0u == cmpRes))
        {

            cmpRes = Cy_Crypto_Core_MemCmp(base, (void const *)encodingArrRemap,
                            (void const *)(decryptedSignatureRemap + psLength + 3u),
                            (uint16_t)encodingArrSize);
        }

        /* Check the digest */
        if (0u == cmpRes)
        {

            cmpRes = Cy_Crypto_Core_MemCmp(base, (void const *)digestRemap,
                            (void const *)(decryptedSignatureRemap + (decryptedSignatureLength - locDigestSize)),
                            (uint16_t)locDigestSize);
        }

        if (0u == cmpRes )
        {
            *verResult = CY_CRYPTO_RSA_VERIFY_SUCCESS;
        }
    }

    return (tmpResult);
}

/** \} group_crypto_lld_asymmetric_functions */
#endif /* defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED) */



#if defined(CY_CRYPTO_CFG_RSA_SIGN_ENABLED)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_Sign
****************************************************************************//**
*
* The functions forms the PKCS1-v1_5 padding of the message needed for signature generation.
* \ref Cy_Crypto_Core_Rsa_Proc should be called after for generating the signature.
* Supports only PKCS1-v1_5 format, inside of this format supported padding
* using only SHA, cases with MD2 and MD5 are not supported.
* PKCS1-v1_5 described here, page 31:
* http://www.emc.com/collateral/white-papers/h11300-pkcs-1v2-2-rsa-cryptography-standard-wp.pdf
*
* For CAT1C & CAT1D devices when D-Cache is enabled parameter digest & signature must align and end in 32 byte boundary.
*
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param digestType
* SHA mode used for hash calculation \ref cy_en_crypto_sha_mode_t.
*
* \param digest
* The pointer to the hash of the message or the message whose signature is to be generated.
*
* \param digestLength
* The length of the message whose signature to be generated and is applicable for CY_CRYPTO_MODE_SHA_NONE mode.
*
* \param signature
* The pointer to the signature buffer.
*
* \param signatureLength
* The length of the signature buffer.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_Rsa_Sign(CRYPTO_Type *base,
                            cy_en_crypto_sha_mode_t digestType,
                            uint8_t const *digest,
                            uint32_t digestLength,
                            uint8_t *signature,
                            uint32_t signatureLength)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_SUCCESS;
    uint8_t  *encodingArr = NULL;
    uint32_t encodingArrSize = 0u;
    uint32_t locDigestSize = 0u;
    uint32_t psLength;
    uint8_t* digestRemap;
    uint8_t* signatureRemap;
    uint8_t  *encodingArrRemap = NULL;
    uint8_t* signaturePtr;
    uint32_t oidSize = 0u;

    if( ((NULL == digest) && (digestLength != 0UL))  || (NULL == signature) )
    {
        tmpResult = CY_CRYPTO_BAD_PARAMS;
    }

    digestRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(digest);
    signatureRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(signature);
    signaturePtr = signature;

    if(tmpResult == CY_CRYPTO_SUCCESS)
    {
        switch (digestType)
        {

        #if (CPUSS_CRYPTO_SHA1 == 1) && defined(CY_CRYPTO_CFG_SHA1_ENABLED)
        case CY_CRYPTO_MODE_SHA1:
            encodingArr  = (uint8_t *)sha1EncStr;
            encodingArrSize = sizeof(sha1EncStr);
            locDigestSize      = CY_CRYPTO_SHA1_DIGEST_SIZE;
            break;
        #endif /* (CPUSS_CRYPTO_SHA1 == 1) && defined(CY_CRYPTO_CFG_SHA1_ENABLED) */

        #if (CPUSS_CRYPTO_SHA256 == 1) && defined(CY_CRYPTO_CFG_SHA2_256_ENABLED)
        case CY_CRYPTO_MODE_SHA224:
            encodingArr  = (uint8_t *)sha224EncStr;
            encodingArrSize = sizeof(sha224EncStr);
            locDigestSize      = CY_CRYPTO_SHA224_DIGEST_SIZE;
            break;

        case CY_CRYPTO_MODE_SHA256:
            encodingArr  = (uint8_t *)sha256EncStr;
            encodingArrSize = sizeof(sha256EncStr);
            locDigestSize      = CY_CRYPTO_SHA256_DIGEST_SIZE;
            break;
        #endif /* (CPUSS_CRYPTO_SHA256 == 1) && defined(CY_CRYPTO_CFG_SHA2_256_ENABLED) */

        #if (CPUSS_CRYPTO_SHA512 == 1) && defined(CY_CRYPTO_CFG_SHA2_512_ENABLED)
        case CY_CRYPTO_MODE_SHA384:
            encodingArr  = (uint8_t *)sha384EncStr;
            encodingArrSize = sizeof(sha384EncStr);
            locDigestSize      = CY_CRYPTO_SHA384_DIGEST_SIZE;
            break;

        case CY_CRYPTO_MODE_SHA512:
            encodingArr  = (uint8_t *)sha512EncStr;
            encodingArrSize = sizeof(sha512EncStr);
            locDigestSize      = CY_CRYPTO_SHA512_DIGEST_SIZE;
            break;

        case CY_CRYPTO_MODE_SHA512_224:
            encodingArr  = (uint8_t *)sha512_224EncStr;
            encodingArrSize = sizeof(sha512_224EncStr);
            locDigestSize      = CY_CRYPTO_SHA512_224_DIGEST_SIZE;
            break;

        case CY_CRYPTO_MODE_SHA512_256:
            encodingArr  = (uint8_t *)sha512_256EncStr;
            encodingArrSize = sizeof(sha512_256EncStr);
            locDigestSize      = CY_CRYPTO_SHA512_256_DIGEST_SIZE;
            break;
        #endif /* (CPUSS_CRYPTO_SHA512 == 1) && defined(CY_CRYPTO_CFG_SHA2_512_ENABLED) */
        case CY_CRYPTO_MODE_SHA_NONE:
            encodingArr  = NULL;
            encodingArrSize = 0;
            locDigestSize  = digestLength;
            break;
        default:
        /* Unknown Digest Type */
            break;
        }

        if(NULL != encodingArr)
        {
            oidSize = encodingArr[5u];
        }

        encodingArrRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(encodingArr);

        if(CY_CRYPTO_MODE_SHA_NONE == digestType)
        {
            // 3bytes for signature header & padding delimiter and 8 bytes for minimal padding.
            if(signatureLength < locDigestSize + 3u + 8u)
            {
                return CY_CRYPTO_BAD_PARAMS;
            }
        }
        else
        {
            if(signatureLength < 10u + locDigestSize + oidSize +3u +8u)
            {
                return CY_CRYPTO_BAD_PARAMS;
            }

            if(locDigestSize != digestLength)
            {
                return CY_CRYPTO_BAD_PARAMS;
            }
        }
        

