zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_rsa.c
    uint8_t* messageRemap;
    uint8_t* processedMessageRemap;

    messageRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(message);
    processedMessageRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(processedMessage);

    uint8_t *expPtrRemap         = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(key->pubExpPtr);
    uint32_t expBitLength        = key->pubExpLength;
    uint8_t *nPtrRemap           = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(key->moduloPtr);
    uint32_t nBitLength          = key->moduloLength;
    uint8_t *barretCoefRemap     = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(key->barretCoefPtr);
    uint8_t *inverseModuloRemap  = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(key->inverseModuloPtr);
    uint8_t *rBarRemap           = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(key->rBarPtr);

    uint32_t yReg                = 5u;
    uint32_t xReg                = 6u;
    uint32_t eReg                = 7u;
    uint32_t modReg              = 8u;
    uint32_t inverseModuloReg    = 9u;
    uint32_t barrettReg          = 10u;
    uint32_t rBarReg             = 11u;
    uint16_t vu_mem_size         = 0U;
    void *vu_mem_address         = NULL;

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)

    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)key->pubExpPtr,(int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(expBitLength));
    SCB_CleanDCache_by_Addr((volatile void *)key->moduloPtr,(int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(nBitLength));
    SCB_CleanDCache_by_Addr((volatile void *)message,(int32_t)messageSize);
#endif

    vu_mem_address = Cy_Crypto_Core_GetVuMemoryAddress(base);
    vu_mem_size = (uint16_t)Cy_Crypto_Core_GetVuMemorySize(base);

    /* Clear all Crypto Buffer before operations */
    Cy_Crypto_Core_MemSet(base, (void*)vu_mem_address, 0x00u, vu_mem_size);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, yReg,             nBitLength);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    } 

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, xReg,             nBitLength);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }   

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, eReg,             nBitLength);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }    

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, modReg,           nBitLength);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }   

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, barrettReg,       nBitLength + (uint32_t)1u);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }    

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, rBarReg,          nBitLength);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }    

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, inverseModuloReg, nBitLength);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }    

    Cy_Crypto_Core_Vu_SetMemValue(base, modReg, nPtrRemap,   nBitLength);
    Cy_Crypto_Core_Vu_SetMemValue(base, eReg,   expPtrRemap, expBitLength);
    Cy_Crypto_Core_Vu_SetMemValue(base, xReg,   (uint8_t const *)messageRemap, messageSize * (uint32_t)8u);

    /* Check coefficients */
    if (barretCoefRemap == NULL)
    {

        tmpResult = Cy_Crypto_Core_Rsa_BarrettGetU(base, barrettReg, modReg, nBitLength);
        if(CY_CRYPTO_SUCCESS != tmpResult)
        {
            return tmpResult;
        } 
        Cy_Crypto_Core_Vu_WaitForComplete(base);
    }
    else
    {
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)

        /* Flush the cache */
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to int32_t.');
        SCB_CleanDCache_by_Addr((volatile void *)key->barretCoefPtr,(int32_t)(CY_CRYPTO_BYTE_SIZE_OF_BITS(nBitLength) + (uint32_t)1u));
#endif
        Cy_Crypto_Core_Vu_SetMemValue(base, barrettReg, barretCoefRemap, nBitLength + (uint32_t)1u);
    }

    if (rBarRemap == NULL)
    {
        /* inverseModuloReg used here as temp variable */
        CY_CRYPTO_VU_SET_TO_ONE(base, inverseModuloReg);
        tmpResult = Cy_Crypto_Core_Rsa_MontTransform(base, rBarReg, inverseModuloReg, barrettReg, modReg, nBitLength);

        if(CY_CRYPTO_SUCCESS != tmpResult)
        {
            return tmpResult;
        } 

        Cy_Crypto_Core_Vu_WaitForComplete(base);
    }
    else
    {
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)

        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)key->rBarPtr,(int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(nBitLength));
#endif
        Cy_Crypto_Core_Vu_SetMemValue(base, rBarReg, rBarRemap, nBitLength);
    }

    if (inverseModuloRemap == NULL)
    {
        tmpResult = Cy_Crypto_Core_Rsa_MontCoeff(base, inverseModuloReg, modReg, nBitLength);
        if(CY_CRYPTO_SUCCESS != tmpResult)
        {
            return tmpResult;
        }  
        Cy_Crypto_Core_Vu_WaitForComplete(base);
    }
    else
    {
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)

        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)key->inverseModuloPtr,(int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(nBitLength));
#endif
        Cy_Crypto_Core_Vu_SetMemValue(base, inverseModuloReg, inverseModuloRemap, nBitLength);
    }

    tmpResult = Cy_Crypto_Core_Rsa_expModByMont(base,
                                    yReg,
                                    xReg,
                                    eReg,
                                    modReg,
                                    barrettReg,
                                    inverseModuloReg,
                                    rBarReg,
                                    nBitLength);

    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }  
    Cy_Crypto_Core_Vu_WaitForComplete(base);

    /* Copy the tmpResult to output buffer */
    Cy_Crypto_Core_Vu_GetMemValue(base, (uint8_t*)processedMessageRemap, yReg, nBitLength);
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)

